{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"1a955854-dc01-5bb2-b9cb-c6d85c991261","excerpt":"What is true north? Success is not the destination Because what comes after that? Happiness? If success is a pit stop on the way to happiness, why not have that now? Everyone is able to achieve that now, privilege not needed. Be grateful for what you…","frontmatter":{"date":"June 30, 2019","path":"/blog/success-is-not-the-goal","title":"Success is Not the Goal"}}},{"node":{"id":"4769eea3-17f1-5911-a0de-d4c94fc9bfe4","excerpt":"These days, I aim to bring aspects of my life back to the essentials.  What are the basics that I need?  How much do I really need?  Minimalism has given me a structure to start from intention and to design my life out from there. Last year taught me…","frontmatter":{"date":"January 31, 2019","path":"/blog/habits-2019","title":"Habits: 2019 Edition"}}},{"node":{"id":"abaca696-485a-5e50-9d51-585b07ca82fa","excerpt":"Start each meal with: Green leafy vegetables Protein Healthy oil or fat source Add flavor (optional) Enjoy and feel good! . . Example foods: Veggies I tend to cycle through: Kale, spinach, arugula, swiss chard, collard greens, broccoli Protein…","frontmatter":{"date":"August 10, 2018","path":"/blog/simple-eating","title":"Simple Eating"}}},{"node":{"id":"d35ba278-1e0e-5c01-a9df-73523b431430","excerpt":"What is troubling me? Am I struggling with wanting to change something and can’t get perfection? Don’t let perfection be the enemy of better. It’s about progress, not perfection. What’s your goal? Can you take a small or several small steps in the…","frontmatter":{"date":"July 31, 2018","path":"/blog/upset","title":"When I feel stuck and upset"}}},{"node":{"id":"02f202f0-102f-5993-8584-8ba98ffcc0b1","excerpt":"A blank page.\nA new project with no tasks.\nA new city.\nA new crowd. There is a special feeling with new beginnings.  Full of hope, opportunity and possibility.  It can be anything because nothing has yet been ruled out.  No decisions made, no paths…","frontmatter":{"date":"July 17, 2018","path":"/blog/new-beginnings","title":"New beginnings"}}},{"node":{"id":"73fc9660-60af-5fef-ad10-1d2ad7b4678a","excerpt":"Growing up in the 90's, the era of Super Nintendo has shaped me, perhaps more than I realized.  The nostalgia of childhood is linked with the pop culture of the time, yet somehow, at least personally, the connection to video games runs deeper.  I…","frontmatter":{"date":"June 18, 2018","path":"/blog/video-games","title":"A not so brief personal history with video games"}}},{"node":{"id":"215d5f6f-14b6-581b-b88c-46c0f6510b4f","excerpt":"Have you ever seen lightning in the American west?  The sky can be pitch black, no clouds in the sky, and then as if the god of thunder himself appeared, a strike so violent it lights up the sky as if it is daylight.  Suddenly, in an instant, you can…","frontmatter":{"date":"May 25, 2018","path":"/blog/lightning","title":"Lightning"}}},{"node":{"id":"126d4897-a6bd-534c-ae2a-bd9e9673873b","excerpt":"And the big wins.  If you are reading this, this is a big win for me.  10+ years in the making, and spanning 4 different careers paths.  It started when I wanted to share some photos i was taking with my patients at the oncology clinic I worked in…","frontmatter":{"date":"May 13, 2018","path":"/blog/first-post","title":"Celebrate the little wins"}}}]}},"pageContext":{}}